/*
FIFA ONLINE 4를 즐겨하는 주원이는 다음 과정대로 팀을 구성하면 
K년 12월에 되었을 때 팀의 선발 선수 가치의 합은 얼마가 되어 있을지 궁금해 하였다.

팀은 총 11명으로, 포지션 번호는 1 이상 11 이하인 정수이다.
3 월에 같은 포지션 중 선수 가치가 가장 높은 선수가 선발 선수가 된다. 
선수 가치가 가장 높은 선수가 여러 명 있을 경우, 그 중 아무나 선발 선수로 선택한다.
포지션에 해당하는 선수가 없을 시, 해당 포지션을 공석으로 팀을 구성한다.
8월에 현재 팀에 있는 선발 선수의 선수 가치는 모두 1이 떨어진다. 선수 가치는 0보다 작아지지 않는다.
11월에 2의 조건대로 선발 선수를 재구성한다.

선수 N명의 포지션 번호와 선수 가치가 주어졌을 때, 
1,2,3,...K년이 될 때마다 매년 위 과정대로 새로운 팀을 구성한다. 
K년 12월에 되었을 때 만든 팀의 선발 선수 가치의 합을 구하여라.

입력
첫 번째 줄에 선수의 수 N과 K가 공백으로 구분되어 주어진다
두 번째 줄부터 N개의 줄에 걸쳐 각 줄에 
i번째 선수의 포지션 pi, 선수 가치 wi가 공백으로 구분되어 주어진다
입력으로 주어지는 수는 모두 정수이다.
*/

